In [2]:
import numpy as np
import pandas as pd

In [3]:
revenues = pd.Series([5555, 7000, 1980, 400])

In [4]:
revenues.values

array([5555, 7000, 1980,  400])

In [5]:
revenues.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
pd.Series([1,2,3,4,5], index=['A', 'B', 'C', 'D', 'E'])

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [7]:
city_revenues = pd.Series({'Amsterdam': 10000, 'Jakarta': 20000, 'Magetan': 5600})

In [8]:
city_employee_count = pd.Series({'Amsterdam': 10, 'Jakarta': 20})

In [9]:
city_employee_count.values

array([10, 20])

#DATAFRAME

In [10]:
city_data = pd.DataFrame({
    "revenue": city_revenues,
    "employee_count": city_employee_count
})

In [11]:
city_data.index

Index(['Amsterdam', 'Jakarta', 'Magetan'], dtype='object')

In [12]:
city_data.axes[0]

Index(['Amsterdam', 'Jakarta', 'Magetan'], dtype='object')

In [13]:
"revenue" in city_data

True

In [14]:
city_revenues["Jakarta"]

20000

##LOC and Iloc

In [15]:
colors = pd.Series(
    ["red", "purple", "blue", "green", "yellow"],
    index = [1, 2, 3, 5, 8]
)

In [16]:
colors

1       red
2    purple
3      blue
5     green
8    yellow
dtype: object

In [17]:
colors.loc[1]

'red'

In [18]:
colors.iloc[1]

'purple'

In [19]:
colors.iloc[1:3]

2    purple
3      blue
dtype: object

In [20]:
city_revenues.keys()

Index(['Amsterdam', 'Jakarta', 'Magetan'], dtype='object')

In [21]:
city_data.loc["Magetan"]

revenue           5600.0
employee_count       NaN
Name: Magetan, dtype: float64

In [22]:
city_data.iloc[1]

revenue           20000.0
employee_count       20.0
Name: Jakarta, dtype: float64

In [23]:
city_data.loc["Amsterdam": "Tokyo", ["revenue", "employee_count"]]

           revenue  employee_count
Amsterdam    10000            10.0
Jakarta      20000            20.0
Magetan       5600             NaN

In [24]:
further_city_data = pd.DataFrame(
    {"revenue": [7000, 34000], "employee_count": [2, 2]},
    index= ["New York", "Barcelona"]
)

In [25]:
further_city_data

           revenue  employee_count
New York      7000               2
Barcelona    34000               2

In [26]:
city_data

           revenue  employee_count
Amsterdam    10000            10.0
Jakarta      20000            20.0
Magetan       5600             NaN

In [27]:
all_city_data = pd.concat([city_data, further_city_data])

In [28]:
all_city_data

           revenue  employee_count
Amsterdam    10000            10.0
Jakarta      20000            20.0
Magetan       5600             NaN
New York      7000             2.0
Barcelona    34000             2.0

In [29]:
city_countries = pd.DataFrame({
    "country": ["Holland", "Japan", "Holland", "Canada", "Spain"],
    "capital": [1, 1, 0, 0, 0]}, index=['Amsterdam', 'Jakarta', 'Magetan', 'New York', 'Barcelona']
)

In [30]:
cities = pd.concat([all_city_data, city_countries], axis=1)

In [31]:
cities

           revenue  employee_count  country  capital
Amsterdam    10000            10.0  Holland        1
Jakarta      20000            20.0    Japan        1
Magetan       5600             NaN  Holland        0
New York      7000             2.0   Canada        0
Barcelona    34000             2.0    Spain        0

In [32]:
countries = pd.DataFrame({
    "population_millions": [17, 127, 37],
    "continent": ["Europe", "Asia", "North America"]
}, index=["Holland", "Japan", "Canada"])

In [33]:
countries

         population_millions      continent
Holland                   17         Europe
Japan                    127           Asia
Canada                    37  North America

In [34]:
pd.merge(cities, countries, left_on="country", right_index=True, how="left")

,revenue,employee_count,country,capital,population_millions,continent
Amsterdam,10000,10.0,Holland,1,17.0,Europe
Jakarta,20000,20.0,Japan,1,127.0,Asia
Magetan,5600,NaN,Holland,0,17.0,Europe
New York,7000,2.0,Canada,0,37.0,North America
Barcelona,34000,2.0,Spain,0,NaN,NaN